Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтениеЗаписьОдногоЭлемента");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьЧтениеЗаписьОдногоЭлемента() Экспорт

	З = Новый ЗаписьСкобаря;
	З.ЗаписатьНачалоЭлемента();
	З.ЗаписатьЗначение("""N""");
	З.ЗаписатьЗначение(15);
	З.ЗаписатьКонецЭлемента();

	Итог = З.Закрыть();

	юТест.ПроверитьРавенство(Итог, "{""N"",15}");

	Ч = Новый ЧтениеСкобаря;
	Ч.УстановитьСтроку(Итог);

	юТест.ПроверитьРавенство(Ч.Прочитать(), Истина); // {
	юТест.ПроверитьРавенство(Ч.ТипЭлемента, ТипУзлаСкобаря.НачалоЭлемента);

	юТест.ПроверитьРавенство(Ч.Прочитать(), Истина); // "N"
	юТест.ПроверитьРавенство(Ч.ТипЭлемента, ТипУзлаСкобаря.Текст);

	юТест.ПроверитьРавенство(Ч.Прочитать(), Истина); // 15
	юТест.ПроверитьРавенство(Ч.ТипЭлемента, ТипУзлаСкобаря.Текст);

	юТест.ПроверитьРавенство(Ч.Прочитать(), Истина); // }
	юТест.ПроверитьРавенство(Ч.ТипЭлемента, ТипУзлаСкобаря.КонецЭлемента);

КонецПроцедуры
