Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьЗаписьОдногоЭлемента");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьЗаписьОдногоЭлемента() Экспорт

	З = Новый ЗаписьСкобаря;
	З.ЗаписатьНачалоЭлемента();
	З.ЗаписатьЗначение("""N""");
	З.ЗаписатьЗначение(15);
	З.ЗаписатьКонецЭлемента();

	Итог = З.Закрыть();

	юТест.ПроверитьРавенство(Итог, "{""N"",15}");

КонецПроцедуры
